Revit 2024 API
CableTraySizes.ClearAll Method
 Removes all MEPSizes in the cable tray sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void ClearAll()
Visual Basic
Public Sub ClearAll
Visual C++
public:
void ClearAll()
See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace